<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of KIMplus Clientmodul and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.macmangr.munki.KIMplusClientmodul</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>KIMplus Clientmodul</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Downloads the latest version of KIMplus Clientmodul.</string>
			<key>developer</key>
			<string>arvato Systems GmbH</string>
			<key>display_name</key>
			<string>KIMplus Clientmodul</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>postinstall_script</key>
            <string>#!/bin/zsh
    /usr/bin/killall "JavaApplicationStub"
	exec "/private/tmp/KIMplus Clientmodul Installationsprogramm.app/Contents/MacOS/JavaApplicationStub" -q -overwrite
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.macmangr.download.KIMplusClientmodul</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/KIMplus Clientmodul Installationsprogramm.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>CFBundleIdentifier</key>
                                <string>com.install4j.5676-2101-3398-5821.59</string>
                                <key>CFBundleName</key>
                                <string>KIMplus Clientmodul</string>
                                <key>CFBundleVersion</key>
                                <string>%version%</string>
                                <key>LSMinimumSystemVersion</key>
                                <string>10.11</string>
                                <key>path</key>
                                <string>/Applications/KIMplus Clientmodul.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>version_comparison_key</key>
                                <string>CFBundleVersion</string>
                            </dict>
                        </array>
                        <key>items_to_copy</key>
                        <array>
                            <dict>
                                <key>destination_path</key>
                                <string>/tmp/</string>
                                <key>source_item</key>
                                <string>KIMplus Clientmodul Installationsprogramm.app</string>
                            </dict>
                        </array>
                        <key>uninstall_method</key>
                        <string>uninstall_script</string>
                        <key>uninstall_script</key>
                        <string>#!/bin/bash
	/usr/bin/killall "JavaApplicationStub"
	/bin/rm -rf "/Applications/KIMplus Clientmodul.app"
            </string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
