<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the version of STARFACE specified by "MAJOR_VERSION".
The version of the client depends on the version of the PBX, so the correct version should be selected for installation

Available "MAJOR_VERSION" values (as of December 2022) include:
- "7.3"
- "7.2"
- "7.1"
- "7.0""</string>
	<key>Identifier</key>
	<string>com.github.macmangr.download.STARFACE</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>STARFACE</string>
		<key>MAJOR_VERSION</key>
		<string>7.3</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
                <string>enclosure url="(?P&lt;url&gt;https:\/\/www.starface-cdn.de\/starface\/clients\/mac\/STARFACE-%MAJOR_VERSION%.*.dmg)</string>
                <key>result_output_var_name</key>
                <string>url</string>
				<key>url</key>
				<string>https://www.starface-cdn.de/starface/clients/mac/appcast.xml</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
                <string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/STARFACE.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "de.starface.STARFACE-Client" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Q965D3UXEW)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/STARFACE.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
