<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for the latest version of Parallels RAS Client.</string>
	<key>Identifier</key>
	<string>com.github.macmangr.download.ParallelsClient</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Parallels Client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
				<key>re_pattern</key>
				<string>(?:\")(.*?)(?:\")</string>
				<key>result_output_var_name</key>
				<string>MAJOR_VERSION</string>
				<key>url</key>
				<string>https://download.parallels.com/website_links/ras/index.json</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
				<key>re_pattern</key>
				<string>(?:Mac Client)\": \"(https.*?)(?:\")</string>
				<key>result_output_var_name</key>
				<string>url_version</string>
				<key>url</key>
				<string>https://download.parallels.com/website_links/ras/%MAJOR_VERSION%/builds-en_US.json</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
				<key>url</key>
				<string>%url_version%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Parallels International GmbH (4C6364ACXT)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
