<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of ScanSnap Home and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.macmangr.munki.scansnaphome</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ScanSnap Home</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/ScanSnap Home</string>
        <key>MUNKI_CATEGORY</key>
        <string>Peripherals</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
        	<string>ScanSnap Home is a desktop application that edits, manages, and utilizes scanned data from documents, business cards, photos, and receipts to increase your productivity.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>Fujitsu</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
	<string>com.github.macmangr.download.scansnaphome</string>
    <key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
