<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Parallels Desktop and imports it into Munki. This recipe has been tested with major versions 10 through 15 and 18.

For major versions 10 through 15, leave the PLATFORM_ARCH blank in your override.

For major version 16, set the PLATFORM_ARCH in your override to either "intel" or "m1" depending on your desired architecture. Create multiple overrides if you wish to offer both flavors via Munki.

For major version 17, set the PLATFORM_ARCH in your override to "image"

Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.

This recipe differs from the one in keeleysam-recipes because it offers code signature verification, does not require a ParallelsURLProvider processor, and also includes pkg and install recipes.</string>
	<key>Identifier</key>
	<string>com.github.macmangr.munki.ParallelsDesktop</string>
	<key>Input</key>
	<dict>
		<key>DERIVE_MIN_OS</key>
		<string>YES</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Parallels Desktop</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Virtualization tool for running Windows apps without rebooting.</string>
			<key>developer</key>
			<string>Parallels, Inc.</string>
			<key>display_name</key>
			<string>Parallels Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>preuninstall_script</key>
			<string>#!/bin/bash
if [ -f /usr/local/bin/prlsrvctl ]; then
	/usr/local/bin/prlsrvctl deactivate-license
fi
exit 0
</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/bash

# App bundle to remove
app_Bundle="/Applications/Parallels Desktop.app/"
lib_files="/Library/Parallels/"

if [ -d "${app_Bundle}" ]
then
	/bin/echo "Found ${app_Bundle}, removing..."
	/bin/rm -rf "${app_Bundle}"
fi

if [ -d "${lib_files}" ]
then
	/bin/echo "Found ${lib_files}, removing..."
	/bin/rm -rf "${lib_files}"
fi

# Remove the pkg receipt
pkgReceipt="com.parallels.desktop.installer"

/bin/echo "Removing ${pkgReceipt}, removing..."
pkgutil --forget "${pkgReceipt}"
</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.ParallelsDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/Parallels Desktop.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/Parallels Desktop.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/Parallels Desktop.app</string>
				</array>
				<key>derive_minimum_os_version</key>
				<string>%DERIVE_MIN_OS%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>