<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Synology Drive Client and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.macmangr.munki.SynologyDriveClient</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Synology Drive Client</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Synology Drive Client.app</string>
				<string>Remove Synology Drive Client.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Synology Drive Client is the desktop utility that provides file syncing and personal computer backup services on multiple client computers to a centralized server, Synology Drive Server.</string>
			<key>developer</key>
			<string>Synology Inc.</string>
			<key>display_name</key>
			<string>Synology Drive Client</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>postinstall_script</key>
            <string>#!/bin/zsh
    /usr/bin/killall "Synology Drive Client"
	/usr/bin/killall "cloud-drive-eventd"
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ahousseini-recipes.download.SynologyDriveClient</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                        <key>uninstall_method</key>
                        <string>uninstall_script</string>
                        <key>uninstall_script</key>
                        <string>#!/bin/bash
	exec "/Applications/Synology Drive Client.app/Contents/SharedSupport/Remove Synology Drive Client.app"
            </string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
